[
  {
    "path": "blog1/2025-02-14-ggplot2basico/",
    "title": "Iniciando os trabalhos com o ggplot2",
    "description": "Tutorial inicial sobre o pacote ggplot2.",
    "author": [],
    "date": "2025-02-23",
    "categories": [],
    "contents": "\r\nO que é ggplot2?\r\nO ggplot2 é um pacote criado na liguagem R que tem como objetivo criar, editar e modificar gráficos de alta qualidade, facilitando a interpretação de resultados de coletas de dados e extração de insights acerca dos dados.\r\nIntrodução\r\nA ideia principal do ggplot2 é construir, camada por camada, o gráfico desejado, baseado nas informações disponíveis. As camadas desde pacote podem ser descritas conforme a Figura 1.\r\n\r\nDescrevendo sucintamente cada uma delas, temos o seguinte:\r\nDados (data): Fonte das informações utilizadas no gráfico, usualmente representado por um objeto da classe data.frame ou tibble;\r\nEstética (aesthetics):\r\nGeometria (geometries): O tipo de gráfico que será criado (Ex: barras, colunas, pizza, box-plot, histograma, etc.);\r\nFacetas (facets): Informado quando o usuário precisa ilustrar uma grande com mais de um gráfico, de acordo com diferentes critérios;\r\nEstatísticas (statistics): Estatísticas importantes (Ex: média, mediana, desvio padrão, etc.) que podem ser incluídas através de elementos gráficos;\r\nCoordenadas (coordinates):\r\nTema (theme): Controla a aparência geral do gráfico. O ggplot2 já possui um tema padrão e algumas alternativas de escolha. No entanto, um novo tema pode ser criado ou algum tema existente pode ser alterado.\r\nCada elemento gráfico é especificado individualmente, e a combinação de todos eles resulta do gráfico desejado. Vamos entender como funciona o processo.\r\nEntendendo as camadas do ggplot2\r\nPara entender o processo da construção de gráficos, vamos considerar apenas as três primeiras camadas: data, aesthetics e geometries.\r\nConsiderando a base dados mtcars, usualmente utilizada em diversos exemplos, temos os dados abaixo:\r\n\r\n\r\nhead(mtcars)\r\n\r\n                   mpg cyl disp  hp drat    wt  qsec vs am gear carb\r\nMazda RX4         21.0   6  160 110 3.90 2.620 16.46  0  1    4    4\r\nMazda RX4 Wag     21.0   6  160 110 3.90 2.875 17.02  0  1    4    4\r\nDatsun 710        22.8   4  108  93 3.85 2.320 18.61  1  1    4    1\r\nHornet 4 Drive    21.4   6  258 110 3.08 3.215 19.44  1  0    3    1\r\nHornet Sportabout 18.7   8  360 175 3.15 3.440 17.02  0  0    3    2\r\nValiant           18.1   6  225 105 2.76 3.460 20.22  1  0    3    1\r\n\r\nSuponha que estejamos interessados na variável hp, potência em cavalos, e que para investigá-la, inicialmente vamos construir um histograma. Nossas três camadas serão as seguintes:\r\ndata: a base de dados mtcars;\r\naesthetics: o eixo do histograma. No caso, será o eixo X;\r\ngeometries: especificar que desejamos contruir um histograma.\r\nPortanto, em código R, temos o seguinte:\r\n\r\n\r\nggplot(mtcars, aes(x = hp)) +\r\n  geom_histogram()\r\n\r\n\r\n\r\nNote que as demais camadas não foram especificadas. Mas não significa necessariamente que elas não existam. Sobre elas, temos o seguinte:\r\nfacets: por padrão, apenas um gráfico é gerado. Como não houve especificação, aplicou-se o padrão;\r\nstatistics: não se aplicou, visto que não foram incluídas estatísticas no gráfico;\r\ncoordinates: utilizou-se as coordenadas padrão, considerando o eixo X. Mas existe a opção de inverter as coordenadas;\r\ntheme: não foi especificado, mas o tema padrão do ggplot2 foi utilizado;\r\n\r\n\r\n\r\n",
    "preview": "blog1/2025-02-14-ggplot2basico/rggplot2_files/figure-html5/exemplo_1-1.png",
    "last_modified": "2025-02-23T12:42:37-03:00",
    "input_file": "rggplot2.knit.md"
  }
]
